In [170]:
import numpy as np
import pandas as pd

np.random.seed(1000)
rows =5000000
data = {
    "Id" : np.arange(1,rows+1),
    "Age": np.random.randint(22,60,size=rows),
    "Salary": np.random.randint(30000,150000,size=rows),
    "Experienced_years":np.round(np.random.uniform(1,15,size=rows),1),
    "Department":np.random.choice(["IT","HR","FINANCE","MARKETING","SALES"],size=rows),
    "Perfomance_Score":np.round(np.random.uniform(1,5,size=rows),1),
    "target":np.random.choice([0 ,1],size=rows)
    
    
}

df=pd.DataFrame(data)
df.to_csv(r"E:\output.csv", index=False)



df.head()

   Id  Age  Salary  Experienced_years Department  Perfomance_Score  target
0   1   45   53228               12.2         IT               1.8       1
1   2   29   41847                5.7         IT               1.7       0
2   3   22  101479                4.7         IT               1.5       0
3   4   52   91592               10.6      SALES               2.5       0
4   5   50   35293                9.4         IT               2.3       0

In [19]:
# Display the first 10 rows of the dataset.
df.head(10)

   Id  Age  Salary  Experienced_years Department  Perfomance_Score  target
0   1   45  111769                5.8  MARKETING               1.9       1
1   2   29   89733               11.5      SALES               2.6       1
2   3   22   79214                4.5         IT               4.0       0
3   4   52   87108                5.5  MARKETING               1.4       0
4   5   50   43962                2.1  MARKETING               3.4       0
5   6   23  134926                2.4  MARKETING               4.3       0
6   7   22   39192               12.5    FINANCE               2.1       1
7   8   47  134344               10.1  MARKETING               4.3       1
8   9   50  124076                3.8         IT               4.5       0
9  10   49   40377                9.2         IT               2.3       0

In [23]:
#Find the number of rows and columns in the dataset.
df.shape
#List all column names and their data types.
df.dtypes

Id                     int32
Age                    int32
Salary                 int32
Experienced_years    float64
Department            object
Perfomance_Score     float64
target                 int32
dtype: object

In [26]:
#Check if there are any missing values in each column.
df.isnull().sum()

Id                   0
Age                  0
Salary               0
Experienced_years    0
Department           0
Perfomance_Score     0
target               0
dtype: int64

In [31]:
#Find the average age of employees.
df["Age"].mean()

40.490796

In [33]:
#Find the minimum, maximum, and mean salary.
df["Salary"].agg(["min","max","mean"])

min      30000.000000
max     149999.000000
mean     90000.185578
Name: Salary, dtype: float64

In [38]:
#Count how many employees are in each department.
df["Department"].value_counts()

IT           100314
SALES        100142
FINANCE      100062
HR            99923
MARKETING     99559
Name: Department, dtype: int64

In [71]:
df.groupby("Department")["Salary"].mean().round(2)

Department
FINANCE      90023.46
HR           89960.45
IT           90050.13
MARKETING    89909.23
SALES        90056.97
Name: Salary, dtype: float64

In [80]:
#Identify employees with 15 years of experience only.
df[df["Experienced_years"]==15]

,Id,Age,Salary,Experienced_years,Department,Perfomance_Score,target
354,355,25,67773,15.0,SALES,3.4,1
494,495,58,146369,15.0,IT,2.3,0
818,819,51,54424,15.0,HR,2.5,1
847,848,38,91545,15.0,FINANCE,1.8,1
1298,1299,30,68149,15.0,SALES,4.1,0
...,...,...,...,...,...,...,...
499296,499297,58,123229,15.0,SALES,1.7,0
499348,499349,35,135747,15.0,MARKETING,2.7,0
499637,499638,22,120331,15.0,IT,3.4,1
499755,499756,27,90233,15.0,SALES,2.8,0
499780,499781,29,93108,15.0,FINANCE,2.0,0

In [85]:
#Find the top 5 highest-paid employees
df.nlargest(5,"Salary")

,Id,Age,Salary,Experienced_years,Department,Perfomance_Score,target
65709,65710,49,149999,5.5,MARKETING,4.7,1
66820,66821,23,149999,8.4,FINANCE,2.2,0
106547,106548,32,149999,14.0,MARKETING,1.5,0
185025,185026,39,149999,11.1,IT,3.2,1
208599,208600,52,149999,6.1,HR,1.8,1

In [91]:
#How many employees have:Age > 40,Salary > 100,000
df[(df["Age"]>40) & (df["Salary"]>100000)]

,Id,Age,Salary,Experienced_years,Department,Perfomance_Score,target
0,1,45,111769,5.8,MARKETING,1.9,1
7,8,47,134344,10.1,MARKETING,4.3,1
8,9,50,124076,3.8,IT,4.5,0
10,11,58,112002,2.3,SALES,2.8,1
11,12,58,102364,10.5,MARKETING,2.8,1
...,...,...,...,...,...,...,...
499961,499962,59,125199,9.4,MARKETING,2.0,0
499964,499965,52,114984,4.2,HR,1.8,0
499974,499975,48,122166,11.4,MARKETING,3.3,0
499982,499983,48,106588,5.1,IT,1.6,1
499987,499988,59,149440,4.3,MARKETING,1.3,1

In [92]:
#Find employees from IT department with performance score ≥ 4.5.

In [123]:
df[(df["Department"] == "IT")&(df["Perfomance_Score"] >=4.5)]

#Find employees from Marketing department with performance score >= 4.5 salary > 100,000.
df[(df["Department"] =="MARKETING")&(df["Perfomance_Score"] >=4.5) & (df["Salary"] > 100000) & (df["target"]==1)]

,Id,Age,Salary,Experienced_years,Department,Perfomance_Score,target
210,211,55,106363,13.4,MARKETING,4.9,1
459,460,48,139483,5.5,MARKETING,4.6,1
682,683,31,138700,2.9,MARKETING,4.5,1
815,816,47,149027,5.4,MARKETING,4.7,1
855,856,25,139140,6.9,MARKETING,4.6,1
...,...,...,...,...,...,...,...
499018,499019,38,119199,14.6,MARKETING,4.9,1
499097,499098,26,148607,11.3,MARKETING,4.7,1
499290,499291,30,140398,13.9,MARKETING,4.9,1
499352,499353,53,139955,4.0,MARKETING,4.9,1
499760,499761,33,132460,6.7,MARKETING,4.6,1

In [126]:
# Calculate the average performance score for each department.
df.groupby("Department")["Perfomance_Score"].mean().round(2)

Department
FINANCE      3.00
HR           2.99
IT           3.00
MARKETING    2.99
SALES        3.01
Name: Perfomance_Score, dtype: float64

In [135]:
#Find employees whose salary is above the overall average salary.
avg_salary=df["Salary"].mean().round(2)
[df["Salary"] > avg_salary]

[0          True
 1         False
 2         False
 3         False
 4         False
           ...
 499995    False
 499996    False
 499997    False
 499998     True
 499999    False
 Name: Salary, Length: 500000, dtype: bool]

In [143]:
#What percentage of employees have target = 1?
percentage = df["target"].mean() * 100
percentage

#2nd method 
(df["target"].value_counts(normalize=True)*100)

1    50.0748
0    49.9252
Name: target, dtype: float64

In [155]:
#For each department, calculate:#Mean age  #Mean salary #Mean experience

df.groupby("Department").agg(
{
    "Age" : "mean",
    "Salary" : "mean",
    "Experienced_years" : "mean"
}).round(2)

              Age    Salary  Experienced_years
Department
FINANCE     40.39  90023.46               7.99
HR          40.51  89960.45               7.99
IT          40.53  90050.13               8.01
MARKETING   40.49  89909.23               7.99
SALES       40.54  90056.97               8.00

In [164]:
#Find the department with the highest average performance score.

df.groupby("Department").agg(
{
    "Perfomance_Score" : "mean"
}).round(2)

#  with highest use idxmax() function
df.groupby("Department")["Perfomance_Score"].mean().idxmax()

'SALES'

In [166]:
#Compare average salary between employees with target = 0 and target = 1.

df.groupby("target")["Salary"].mean()

target
0    90033.395608
1    89967.074764
Name: Salary, dtype: float64